codycarter1763/cFS-ESP32-Telemetry/apps/esp32_bridge_app/fsw/src/esp32_bridge_app_dispatch.c
/************************************************************************
 * NASA Docket No. GSC-19,200-1, and identified as "cFS Draco"
 *
 * Copyright (c) 2023 United States Government as represented by the
 * Administrator of the National Aeronautics and Space Administration.
 * All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may
 * not use this file except in compliance with the License. You may obtain
 * a copy of the License at http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 ************************************************************************/

/**
 * \file
 *   This file contains the source code for the Sample App.
 */

/*
** Include Files:
*/
#include "esp32_bridge_app.h"
#include "esp32_bridge_app_dispatch.h"
#include "esp32_bridge_app_cmds.h"
#include "esp32_bridge_app_eventids.h"
#include "esp32_bridge_app_msgids.h"
#include "esp32_bridge_app_msg.h"

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/
/*                                                                            */
/* Verify command packet length                                               */
/*                                                                            */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/
bool ESP32_BRIDGE_APP_VerifyCmdLength(const CFE_MSG_Message_t *MsgPtr, size_t ExpectedLength)
{
    bool              result       = true;
    size_t            ActualLength = 0;
    CFE_SB_MsgId_t    MsgId        = CFE_SB_INVALID_MSG_ID;
    CFE_MSG_FcnCode_t FcnCode      = 0;

    CFE_MSG_GetSize(MsgPtr, &ActualLength);

    /*
    ** Verify the command packet length.
    */
    if (ExpectedLength != ActualLength)
    {
        CFE_MSG_GetMsgId(MsgPtr, &MsgId);
        CFE_MSG_GetFcnCode(MsgPtr, &FcnCode);

        CFE_EVS_SendEvent(ESP32_BRIDGE_APP_CMD_LEN_ERR_EID,
                          CFE_EVS_EventType_ERROR,
                          "Invalid Msg length: ID = 0x%X,  CC = %u, Len = %u, Expected = %u",
                          (unsigned int)CFE_SB_MsgIdToValue(MsgId),
                          (unsigned int)FcnCode,
                          (unsigned int)ActualLength,
                          (unsigned int)ExpectedLength);

        result = false;

        ESP32_BRIDGE_APP_Data.CommandErrorCounter++;
    }

    return result;
}

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/
/*                                                                            */
/* SAMPLE ground commands                                                     */
/*                                                                            */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/
void ESP32_BRIDGE_APP_ProcessGroundCommand(const CFE_SB_Buffer_t *SBBufPtr)
{
    CFE_MSG_FcnCode_t CommandCode = 0;

    CFE_MSG_GetFcnCode(&SBBufPtr->Msg, &CommandCode);

    /*
    ** Process SAMPLE app ground commands
    */
    switch (CommandCode)
    {
        case ESP32_BRIDGE_APP_NOOP_CC:
            if (ESP32_BRIDGE_APP_VerifyCmdLength(&SBBufPtr->Msg, sizeof(ESP32_BRIDGE_APP_NoopCmd_t)))
            {
                ESP32_BRIDGE_APP_NoopCmd((const ESP32_BRIDGE_APP_NoopCmd_t *)SBBufPtr);
            }
            break;

        case ESP32_BRIDGE_APP_RESET_COUNTERS_CC:
            if (ESP32_BRIDGE_APP_VerifyCmdLength(&SBBufPtr->Msg, sizeof(ESP32_BRIDGE_APP_ResetCountersCmd_t)))
            {
                ESP32_BRIDGE_APP_ResetCountersCmd((const ESP32_BRIDGE_APP_ResetCountersCmd_t *)SBBufPtr);
            }
            break;

        case ESP32_BRIDGE_APP_PROCESS_CC:
            if (ESP32_BRIDGE_APP_VerifyCmdLength(&SBBufPtr->Msg, sizeof(ESP32_BRIDGE_APP_ProcessCmd_t)))
            {
                ESP32_BRIDGE_APP_ProcessCmd((const ESP32_BRIDGE_APP_ProcessCmd_t *)SBBufPtr);
            }
            break;

        case ESP32_BRIDGE_APP_DISPLAY_PARAM_CC:
            if (ESP32_BRIDGE_APP_VerifyCmdLength(&SBBufPtr->Msg, sizeof(ESP32_BRIDGE_APP_DisplayParamCmd_t)))
            {
                ESP32_BRIDGE_APP_DisplayParamCmd((const ESP32_BRIDGE_APP_DisplayParamCmd_t *)SBBufPtr);
            }
            break;

        default:
            CFE_EVS_SendEvent(ESP32_BRIDGE_APP_CC_ERR_EID,
                              CFE_EVS_EventType_ERROR,
                              "Invalid ground command code: CC = %d",
                              CommandCode);
            break;
    }
}

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/
/*                                                                            */
/*  Purpose:                                                                  */
/*     This routine will process any packet that is received on the SAMPLE    */
/*     command pipe.                                                          */
/*                                                                            */
/* * * * * * * * * * * * * * * * * * * * * * * *  * * * * * * *  * *  * * * * */
void ESP32_BRIDGE_APP_TaskPipe(const CFE_SB_Buffer_t *SBBufPtr)
{
    static CFE_SB_MsgId_t CMD_MID     = CFE_SB_MSGID_RESERVED;
    static CFE_SB_MsgId_t SEND_HK_MID = CFE_SB_MSGID_RESERVED;

    CFE_SB_MsgId_t MsgId = CFE_SB_INVALID_MSG_ID;

    /* cache the local MID Values here, this avoids repeat lookups */
    if (!CFE_SB_IsValidMsgId(CMD_MID))
    {
        CMD_MID     = CFE_SB_ValueToMsgId(ESP32_BRIDGE_APP_CMD_MID);
        SEND_HK_MID = CFE_SB_ValueToMsgId(ESP32_BRIDGE_APP_SEND_HK_MID);
    }

    CFE_MSG_GetMsgId(&SBBufPtr->Msg, &MsgId);

    /* Process all SB messages */
    if (CFE_SB_MsgId_Equal(MsgId, SEND_HK_MID))
    {
        /* Housekeeping request */
        ESP32_BRIDGE_APP_SendHkCmd((const ESP32_BRIDGE_APP_SendHkCmd_t *)SBBufPtr);
    }
    else if (CFE_SB_MsgId_Equal(MsgId, CMD_MID))
    {
        /* Ground command */
        ESP32_BRIDGE_APP_ProcessGroundCommand(SBBufPtr);
    }
    else
    {
        /* Unknown command */
        CFE_EVS_SendEvent(ESP32_BRIDGE_APP_MID_ERR_EID,
                          CFE_EVS_EventType_ERROR,
                          "SAMPLE: invalid command packet,MID = 0x%x",
                          (unsigned int)CFE_SB_MsgIdToValue(MsgId));
    }
}
